import './Biography.scss';

import motherImg from '../../../assets/biography/mother.png';
import fatherImg from '../../../assets/biography/father.png';
import schoolImg from '../../../assets/biography/school.png';
import universityImg from '../../../assets/biography/university.png';

function Biography() {
  return (<>
    <h1>Биография Д.И. Менделеева</h1>
    <p><b>Дмитрий Иванович МЕНДЕЛЕЕВ ‒ гениальный русский учёный и общественный деятель. 
      Широко известен как химик, физик, экономист, метролог, технолог, геолог, метеоролог, педагог, 
      воздухоплаватель.</b></p>
    <h2>1834 - 1855. Детство и юность</h2>
    <p>Д. И. Менделеев родился 27 января (8 февраля) 1834 года в г. Тобольске в семье директора Тобольской 
      гимназии Ивана Павловича Менделеева и его жены Марии Дмитриевны.</p>
    
    <section className='row'>
      <figure className='column biography-illustration'>
        <img src={motherImg}/>
        <p>Мать - Мария Дмитриевна Менделеева </p>
      </figure>
      <figure className='column biography-illustration'>
        <img src={fatherImg}/>
        <p>Отец - Иван Павлович Менделеев</p>
      </figure>
    </section>
    <section className='row'>
      <figure className='column biography-illustration'>
        <img src={schoolImg}/>
        <p>Здание Тобольской губернской гимназии, в которой учился Митя Менделеев</p>
      </figure>
    </section>
    
    <p>В 1849 г. Митя окончил Тобольскую гимназию. По правилам тех лет Дмитрий должен был продолжать свое образование 
      в Казанском университете, к которому была приписана гимназия. Однако желание матери дать младшему сыну престижное 
      столичное образование, было непреклонным, и в 1849 году семья отправилась в Москву. Из-за бюрократических препонов 
      поступить в Московский университет Дмитрию не удалось, и в 1850 году Менделеевы переехали в Петербург. 
      В конце лета 1850 года, после вступительных экзаменов, Дмитрий Менделеев был зачислен на физико-математический 
      факультет Главного педагогического института.</p>
    
    <p>Главный педагогический институт практически представлял собой отделение Петербургского университета и занимал 
      часть его здания. Наряду с работами по химии в студенческие годы Д. И. Менделеев серьезно занимался минералогией, 
      зоологией, ботаникой.</p>

    <section className='row'>
      <figure className='column biography-illustration'>
        <img src={universityImg}/>
        <p>Здание С.-Петербургского университета. В этом здании учился в Главном педагогическом институте (1850-1855), 
          преподавал (1857-1890) и жил (1866-1890) Д.И. Менделеев</p>
      </figure>
    </section>

    <p>Его первой значительной исследовательской работой, выполненной под руководством профессора А.А. 
      Воскресенского при выпуске из института, стала диссертация «Изоморфизм в связи с другими отношениями 
      кристаллической формы при различии в составе». Менделеев исследовал в ней способность некоторых веществ 
      заменять друг друга в кристаллах, не меняя при этом формы кристаллической решетки. В этом явлении — изоморфизме, 
      отчетливо прослеживались сходства в поведении различных элементов. Эта первая работа Д.И. Менделеева определила 
      главное направление в его научном поиске, а после 15 лет упорной работы привела к открытию периодического закона 
      и системы элементов. Впоследствии он писал: <i>«Составление этой диссертации вовлекло меня более всего в изучение 
      химических отношений. Этим она определила многое»</i>.</p>
    <p></p>
  </>);
}

export default Biography